[
  {
    "title":"Welcome",
    "keyCombination":[
      "return"
    ],
    "description":"Press displayed key to go to the next slide",
    "title2":"Transition Centre For Young Adults with Down Syndrome",
    "desc2":"<p class=\"text-center\">Hiruni Perera<\/p>",
    "image": ""
  },
  {
    "title":"Copy Item",
    "keyCombination":[
      "Ctrl",
      "c"
    ],
    "description":"Copy item",
    "title2":"",
    "desc2":"In relation to the research conducted, it is proposed to establish a Transition Centre for young adults with Down Syndrome. Even if one can find a school to enroll and provide special education for children affected with Down Syndrome, these schools do not educate them how to perceive their adult life or to seek employment in the society. To bridge the gap between school life to adulthood and enable them to fully integrate with the general public we need to harvest talents, thereby allowing them to enroll in skilled employment and contribute to the productivity of the society. The primary objective of this project is to create and design a space where young adults affected with Down Syndrome have the opportunity to foster their knowledge and up bring their skills through specialized schooling and training programs. This space would act as a transition facility where young adults with Down Syndrome can enhance their skills and embrace adulthood independently. These skills would enable them to seek open employment and at the same time, providing the opportunity for businesses to integrate this labor into their productivity, thereby contributing to the betterment of the country's GDP (Gross Domestic Product).\n        <br\/>\nSri Lanka is a country that values education, and it has an esteemed level of 92% literacy rate in Asia and on average above the world (UNESCO UIS, 2020). Children between the ages of 5 to 14 have a record high of 95% who attend school. Distressingly of the 10.6% of children who have disabilities, only 0.4% of them attend schools. Significantly 10.2% do not attend school due to their disabilities. (UNICEF ROSA, 2007).\n.",
    "image": ""
  },
  {
    "title":"Cut Item",
    "keyCombination":[
      "Ctrl",
      "x"
    ],
    "description":"Cut item",
    "title2":"",
    "desc2":"According to the Department census and statistics 343,689 people suffer cognitive disabilities in Sri Lanka (Department of Census and Statistics, 2020), in relation to that 36% suffer with Down Syndrome (Muttiah, Drager and Connor, 2020). It can be defined as genetic disorder that results when an individual is born with an extra copy of the 21st chromosome. It comes with characteristic physical and mental traits such as distinct facial features and short stature and babies may need health interventions including surgeries to address heart, hearing or eyesight issues (Cicerchia, 2020).\n        <br\/>\nIt’s the bitter truth that people suffering from Down Syndrome are not always fully accepted by our society. Even though differently abled is now the phrase we use, it's been limited to a new word in our vocabulary and the prejudice continues. When there is injustice there is always a counter force, this can be within the community or external. Some exceptional individuals with Down Syndrome, but have literally brought the phrasing “differently abled” into life are, Ángela Bachiller (Politician), Jamie Brewer (Actor) Marte Wexelsen Goksøyr (Public speaker) Diand Madeline Stuart (Supermodel) (Griffin, 2020). These are just a few who broke through barriers and the unharvested talents are still at large within the community, especially in developing countries such as Sri Lanka. It's the polite rejection from the greater society that we need to change, and let them fully integrate, bringing in their contribution to the country. Also, at the same time allowing them to endure their adult life independently.",
    "image": ""
  },
  {
    "title":"Paste Item",
    "keyCombination":[
      "Ctrl",
      "v"
    ],
    "description":"Paste Item",
    "title2":"",
    "desc2":"It is important to allocate resources and opportunities to people with learning difficulties, the same as people without. Many public schools currently in Sri Lanka do not publicly discriminate against students with learning difficulties, but as a developing country Sri Lankan schools lack the resources required by such students. For instance, the pupil-teacher ratio is currently 22.93 and this deteriorates when you take the rural parts of the island (UNESCO UIS, 2020)., thereby these public schools don't offer Down Syndrome students, with the time and dedication they require to excel their learning difficulties. A specialized school and training center that is equipped with adequate resources is a necessity to cater to such students. The primary goal of this Centre is to create a space that provides students with Down syndrome and address their special needs through well planned, natural lighting, comfort and sensory spaces. The space will directly help them to enhance their skills in order to adopt with the general society and seek skilled employment. This space will be driven with modern technology and at the same time employee professionals to train them with social aspects. Having a job builds confidence and self-esteem for people with Down syndrome, whether it is a paid or volunteer position. It’s also a good way to increase awareness of learning difficulties among the general public, especially when it comes to showing the many talents these very capable and special individuals possess (Cicerchia , 2020)\n        <br\/>\n        Understanding and analyzing similar facilities helping young adults with Down syndrome or other disabilities is vital for the success of this project. Below are three similar spaces located in different parts of the world, established to provide similar services for the betterment of young adults with Down Syndrome.",
    "image": ""
  },
  {
    "title":"Display properties",
    "keyCombination":[
      "Alt",
      "return"
    ],
    "description":"Display properties for the selected item",
    "title2":"The Independent Living and Training Centre, Singapore",
    "desc2":"The Independent Living and Training Centre is Singapore's first facility for young adults with Down Syndrome and was established on April 27th 2016 at Blk17A, Telok Blangah. This space provides training and practice in developing skills for independent living for young adults. Thus, enabling them to adopt easily with the general public. The idea was brought into life by caregivers, as they were worried if the need did arise, Down syndrome adults would not be able to live independently without depending on others.\n<br\/>\nThe space can accommodate up to 24 young adults and consists of practice rooms, a kitchen, infant toddler room and a family room. These specialized areas aim to help young adults with Down syndrome to develop daily living skills and practice them in homely realistic surroundings. In return enhancing greater independence. \n<br\/>\nThe skills it will impart include independent travelling, personal hygiene, time management, home economics, personal safety, financial planning, self-advocacy, decision making and communal living.\n<br\/>\nAccording to Mr. Alvin Ho the assistant director of the charity, the ultimate goal for the Centre is to partner up with local service groups and organizations within the community to provide employment or carry out collaborative projects. \n",
    "image": ""
  },
  {
    "title":"Undo",
    "keyCombination":[
      "Ctrl",
      "z"
    ],
    "description":"Undo the last action",
    "title2":"",
    "desc2":"The facility enrolls students over the age of 18 with Down syndrome. In a Statement the Government minister Mr. Sam Tan of Minister of State for Foreign Affairs and Social and Family Development said the private sector should continue to work closely with initiatives such as this Centre. Thereby providing equal opportunities for capable young adults with Down syndrome to seek employment and contribute to national workforce and productivity. Mr. Sam Tan of Minister of State for Foreign Affairs and Social and Family Development:\n        <br\/>\n\"Persons with special needs will find it difficult to achieve higher levels of independence without the rest of society playing its part,\"\n",
    "image": ""
  },
  {
    "title":"Redo",
    "keyCombination":[
      "Ctrl",
      "y"
    ],
    "description":"Redo the last action",
    "title2":"The Summit Center, Western New York",
    "desc2":"Founded in 1973 by Nancy Harris and originally known as the Language Development Program, it was established in order to develop language skills of her son who suffered from severe hearing loss. Started in the kitchen of her home in Williamsville with mere four children and now is a center which is staffed by 500 professionals that successfully changes the life of 1,350 children and adults each year. \n<br\/>\nFollowing evidence-based educational, behavioral health, adult and community programs for their students. The Summit Center not only directly works for the betterment of children and young adults, but also provides free training sessions for professionals and Parents so they can understand and harvest these skills once the students leave the training center. \n<br\/>\nA separate young adult division carries out habilitation programs to employment services. The Summit Center is devoted in enhancing your adult life wherever it may take you. Not only does the center help you find employment but helps you maintain and overcome barriers that you may face during work. A SEMP specialist will first meet with you to determine your skills and areas of interest. For example, if you are interested in art, we may try to find you a placement at an arts & crafts store. Your employment specialist will then work with you to apply for that job, arrange transportation, attend job interviews with you, and provide job site coaching to ensure that you are comfortable in your new work setting. They look into all aspects of work from packing your lunch to making new friends at your job. \n",
    "image": ""
  },
  {
    "title":"Bold",
    "keyCombination":[
      "Ctrl",
      "b"
    ],
    "description":"Bold the selected text",
    "title2":"",
    "desc2":"They go a step beyond and even assure the employer, why they should employ through The Summit Center. Some of the key benefits for the employer are, assistance with training techniques, tax incentives, and a diversified workforce demonstrates that the organization is committed to the local community, \n\nWith over 26 million coming in as donations in each financial year and the continuous effort brought in by our voluntary staff, we will be able to change the life of many who suffer from autism and other developmental, social and behavioral challenges. Said Stephen R. Anderson (CEO) of The Summit Center\n",
    "image": ""
  },
  {
    "title":"Italic",
    "keyCombination":[
      "Ctrl",
      "i"
    ],
    "description":"Italic the selected text",
    "title2":"The Hong Kong Down Syndrome Centre, Hong Kong",
    "desc2":"This non-profit organization registered since 1987, under the name Hong Kong Down Syndrome Association specializes in serving children and young adults suffering from the disorder. Main motive is to develop the personal growth of their students in all aspects of life. Ranging from vocational training, independent adult life and employment. In recent years, they have been expanding their social enterprises with a view of increasing vocational training and job opportunities for people with disabilities while promoting the concept of “social inclusion”.\n<br\/>\nThis training Centre is subdivided into specialized serving units such as Bradbury parents resource Centre, Jockey Club Down syndrome Centre, Tiptop Training Centre and Employment Services Centre. Each Centre catering to each and every need of an individual or their families affected from Down syndrome.\n",
    "image": ""
  },
  {
    "title":"Next Paragraph",
    "keyCombination":[
      "Ctrl",
      "down"
    ],
    "description":"Move the cursor to the beginning of the next paragraph.",
    "title2":"",
    "desc2":"Jockey Club Down syndrome Centre is the only service Centre in Hong Kong catering to individuals with Down syndrome. The primary goal in this Centre is to harvest and unleash their talents, develop self-reliance, motivate, adopt a healthy lifestyle and be more independent. The above is achieved through professional teachings and training. In comparison to spaces in Hong Kong this facility covers an extensive 1620 square feet and is equipped with a piano room, band room, multipurpose meeting room and professional dance studio. When these rooms are not occupied, they are available on rent basis for outsiders in order to generate extra income for the non-profit organization. \n<br\/>\n‘Tiptop Training Centre’ established in 2004, the space provides both workshop training and employment under one roof. This space facilitates the requirement of a shelter workshop where users are first exposed to supported employment services, where they gain experience before looking for a job in the general employment market. Furthermore, it acts as a safety net for students who have fallbacks, giving them another chance to get re-trained before they seek employment again. “They named our service unit ‘Tiptop Training Centre’, which reflects the Association’s target to operate a training Centre with a tip-top quality of service”. In this facility they accommodate persons aged 15 or above and they undergo training, social skills development, talent enhancement and followed up with job placement and on-the-job training. Also, local businesses have the ability to outsource certain work to the sheltered workshop such as dry goods packaging, hot press lamination, packaging and posting, arts and crafts production, photocopying and binding service, car beauty service and home, shop or office cleaning services.\n",
    "image": ""
  },
  {
    "title":"Previous Paragraph",
    "keyCombination":[
      "Ctrl",
      "up"
    ],
    "description":"Move the cursor to the beginning of the previous paragraph.",
    "title2":"",
    "desc2":"Employment Service Centre provides systematic and on job training, counselling, negotiation of remuneration packages and special working conditions and follow up services to individuals suffering from Down syndrome. This Centre mainly focusses on further increasing their work potential, develop competitiveness at work and ease the adaptation to the work environment. The core objective is here to provide a productive member to the employer and at the same time ensure the employee adopts smoothly to the new work environment. The adoption process is crucial for a person with Down syndrome as a bad experience, such as over pressure might leave the individual with a negative mental impact.\n\nThe Bradbury Parents Resource Centre is mainly created to offer services for family members of persons with Down syndrome. Also, the facility acts as a platform where families can share information, support and exchange ideas. Its utmost importance that you set the correct mindset for the families with a member who has special needs. Thereby this resource facility provides counselling, education and development programs, resource library, support groups, community education and family activities. This space was mainly established after identifying that most individuals with Down Syndrome are discriminated against within the family. Further to create awareness within families how they should accept and cope up with an individual who requires special needs.\n",
    "image": ""
  },
  {
    "title":"Adjust the justification",
    "keyCombination":[
      "alt",
      "j"
    ],
    "description":"Adjust the justification of text in a file.",
    "title2":"",
    "desc2":"USAID the client and the funder for the project, which is to develop and build a space to act as a transition Centre for young adults with Down syndrome. While the space is constructed in Sri Lanka, it is important for us to understand USAID’s policies and vision in helping people with disabilities.    \n<br\/>\nUSAID was established under the presidency of his excellency John. F. Kennedy in 1961, leads the US governments and people’s international developments and humanitarian efforts. Primary goal of USAID has been to help lift lives in poverty, build communities and advance democracy in countries in need. $39.3 billion was allocated in the financial year of 2019 to carry out humanitarian initiatives in over 100 countries across the globe. These efforts can be vastly seen in Africa, Asia, Europe, Eurasia, Latin American, the Caribbean and Middle East. In accordance with the U.S foreign policy the primary budget is divided into empower women, promote global health, support global stability, provide humanitarian assistance and catalyze innovation and partnership. The Global Health arm has been operational over 50 years, the USAID’s global health programs have prevented crisis, saved lives and promoted stability from deadly diseases around the world. They firmly believe that “America is safer and stronger when people can live healthy and productive lives and when nations around the world are self-reliant and can prevent and withstand crisis”.\n",
    "image": ""
  },
  {
    "title":"Displays connection settings",
    "keyCombination":[
      "alt",
      "n"
    ],
    "description":"Displays connection settings",
    "title2":"",
    "desc2":"Under the Global Health outreach, they have categorically supported advancing disability-inclusive development. USAID considers that over 1 billion people in the world or close to 15 percent of the population in the world suffer from some form of disability. Out of the above-mentioned percentage, 8 percent of the population live in developing countries in Africa and Asia. further it’s expected that these numbers will see an increase due to ageing population and diminishing health conditions in these regions. In a statement USAID said that, Persons with disabilities are more likely to experience poverty. They are also less likely to access basic services because of stigma, discrimination and inaccessibility. The lack of access to vital services and programs contributes to their marginalization and exclusion, with little or no option to escape from poverty.\n<br\/>\nThey also believe that persons with disabilities remain invisible. Especially in the overall global development agenda and they have taken upon them to ensure that people with disabilities such as Down syndrome have equal opportunities to contribute to the global advancement. In their commitment to help individuals with disabilities, they have developed an approach named “twin tracked”, this is where they support disability-specific programs to address targeted needs, and they seek to integrate disability into all our programs. This is mainly due to legal, social and economic reasons to include individuals with disabilities in USAID programs globally. For instance, its illegal in many countries including in the US, to discriminate against any individual with any form of disability. USAID strongly believes that disability rights are equal to human rights, excluding one on the grounds of being disable is not only discrimination but a loss for the country and for the global economy.\n",
    "image": ""
  },
  {
    "title":"Displays table content",
    "keyCombination":[
      "alt",
      "c"
    ],
    "description":"Displays table content",
    "title2":"",
    "desc2":"Some sectors that USAID mainly try to enrich under their disability-inclusive development are education, inclusion on political processes, economic empowerment, job training and improving design of health and emergency services. One of the many success stories behind USAID is Karen Cano, a young beautiful lady from Paraguay who has Down syndrome.  Fundación Sarki, a USAID funded partner called for individuals with disabilities to audition to model for a catwalk, Karen was one of the first to respond. Karen and 13 others were chosen with disabilities to walk in the Asuncion Fashion Week. This effective inclusion by Fundación Saraki proves the many abilities that people with disabilities possess. USAID in Paraguay promotes the inclusion of individuals with disabilities in all aspects of life. Karen Cano has gone on to win bronze, silver and gold medals for gymnastics in the special Olympic games in China and Greece. \n<br\/>\nWhen choosing the site for this project one needs to account for; Location, does the site provide a close connection to the general public? The site should not be too isolated from the general public and at the same time, be over exposed which might cause distress or fear within students. Other factors to be considered are easy access, recreation areas, hospitals and other educational institutions should be in close proximity.\n",
    "image": ""
  },
  {
    "title":"Previous directory",
    "keyCombination":[
      "alt",
      "up"
    ],
    "description":"Navigates to previous directory",
    "title2":"",
    "desc2":"The 80 club, situated in Torrington Avenue Colombo 7, was constructed at the beginning of the twentieth century. 8000 square feet Built in typical colonial architecture by the members of the British government for tropical conditions. This two stories structure has the main living spaces upstairs with rooms interconnecting with one another. The most prominent features of the building are the wooden louvred shutters, verandas through wide French doors and thick tiled roofs. These features have not only beautified the space but have insulated the building wonderfully to adapt to the tropical climate. New extensions have been added from the sides and rear of the building to create more spaces by the current landlords. \n<br\/>\nThe building is situated to the back of the extensive land and away from the access road Torrington Avenue. A formal garden in front with a typical nineteenth century driveway defined by low hedges welcomes guests into the property. The club is ideally placed for its members to access, private and national buildings in the surroundings. Facing the property, you find the National Library and archives, Race Course and to the back you find an international cricket ground the SSC. The area is filled with greenery and is a less than 5 minutes’ walk to the Independence square, Independence Arcade, St Bridget’s Convent, Royal College, Royal Sports complex and the National Museum.\n",
    "image": ""
  },
  {
    "title":"Show\/Hide Mask",
    "keyCombination":[
      "Ctrl",
      "m"
    ],
    "description":"Show\/Hide Mask",
    "title2":"",
    "desc2":"Sri Lanka has one of the highest rates of literacy in the world but astonishingly out of the 10.6% of children with disabilities only 0.4% attends schools. This justifies the fact that there is a questionable issue in the educational approach currently deployed for students with any form of disabilities. The first Centre of Down Syndrome children and young adults was established in 2016 in Singapore, which states that Sri Lanka being an Asian country, it's not too late. It’s important to consider the fact that young adults enrolling, will have no or little knowledge and training taking into account that only 0.4% enrolls in schooling. This would make the operations at the Centre twice as more challenging but at the same time justifies the necessity of a Transition Centre for young adults with Down syndrome. The primary goals that we intend to achieve via the Centre, is to ensure that individuals enrolling will leave as independent young adults, ready for employment or employed, will be socially sound, allowing them to fully integrate with the general public. This space will conduct specialized training and teaching programs in relation with modern technology to foster their knowledge and enhance their skills. These skills will benefit the persons enrolling with the Centre and at the same time benefit many other stakeholders such as, Families of these independent young adults will require to invest less time and money on them, businesses will have access to a brand new source of labor and lastly these individuals will contribute towards the country as whereas before they were a burden to the country. Once the Centre is established and success is proven it would be ideal to open similar places, covering the major districts in the island. Health programs funded by the USAID have always been encouraged for expansion when proven successful, further we can seek help and donations from the local government and other entities. The success of this initiative will be judged by the output of an employed, independent, and social young adult with Down syndrome, and not by the kind of work undertaken by people with Down syndrome as it varies from person to person. Some can work in restaurants; others may bag groceries at the supermarket or answer phones at an office. There are celebrated artists with the condition, including painters, singers, dancers and musicians. In all these cases what changed their life was adequate training and crucial supervision throughout childhood to adulthood, this may be done by a devoted parent or a professional Centre like this.",
    "image": ""
  },
  {
    "title":"The End",
    "keyCombination":[
      "",
      ""
    ],
    "description":"",
    "title2":"\"Persons with special needs will find it difficult to achieve higher levels of independence without the rest of society playing its part,\"",
    "desc2":"<p class=\"text-center\">Sam Tan<\/p>",
    "image": ""
  }
]